#Задача №17. Дан список чисел. Определите, 
# сколько в нем встречается различных чисел.
print('Количество различных чисел в введённом списке: ',len(set(input('Через пробел введите список любых чисел: ').split())))
