#Напишите программу для печати всех уникальных значений в словаре. 
#Input: : [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, 
#{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}] 
#Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
L = [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"}, {"V":"S009"},{"VIII":"S007"}]
print('Исходные значения: ',L)
u_value = set( val for dic in L for val in dic.values())
print('Уникальные значения в словаре: ',u_value)