#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
#они сделали S журавликов. Сколько журавликов сделал каждый
#ребенок, если известно, что Петя и Сережа сделали одинаковое
#количество журавликов, а Катя сделала в два раза больше журавликов,
#чем Петя и Сережа вместе?
S=int(input('Введите общее количество журавликов'))
print('Петя сделал журавликов: ',S//4, 'Катя сделала журавликов: ',S//2, 'Серёжа сделал журавликов: ',S//4)
